---
type: FabricationServiceButton
namespace: Autodesk.Revit.DB
version: 2024
members: 21
tags: [revit-api, class]
---

# FabricationServiceButton

`Autodesk.Revit.DB.FabricationServiceButton` · Revit 2024 · 21 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ContainsFabricationPartType | 2016 Subscription Release | `public bool ContainsFabricationPartType ( FabricationPartType partType )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetConditionDescription | 2017 | `public string GetConditionDescription ( int condition )` |
| Method | GetConditionImage | 2016 | `public virtual Bitmap GetConditionImage ( int condition )` |
| Method | GetConditionLowerValue | 2016 | `public double GetConditionLowerValue ( int condition )` |
| Method | GetConditionName | 2016 | `public string GetConditionName ( int condition )` |
| Method | GetConditionUpperValue | 2016 | `public double GetConditionUpperValue ( int condition )` |
| Method | GetImage | 2016 | `public virtual Bitmap GetImage ()` |
| Method | IsExcluded | 2017 Subscription Update | `public bool IsExcluded ()` |
| Method | IsUnrestrictedCondition | 2016 | `public bool IsUnrestrictedCondition ( int condition )` |
| Method | IsValid | 2016 | `public bool IsValid ()` |
| Method | IsValidConditionIndex | 2016 | `public static bool IsValidConditionIndex ( FabricationServiceButton button , int condition )` |
| Property | ButtonIndex | 2016 | `public int ButtonIndex { get ; }` |
| Property | Code | 2016 | `public string Code { get ; }` |
| Property | ConditionCount | 2016 | `public int ConditionCount { get ; }` |
| Property | IsAHanger | 2016 | `public bool IsAHanger { get ; }` |
| Property | IsStraight | 2016 | `public bool IsStraight { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2016 | `public string Name { get ; }` |
| Property | PaletteIndex | 2022 | `public int PaletteIndex { get ; }` |
| Property | ServiceId | 2016 | `public int ServiceId { get ; }` |